# เขียนโปรแกรม รับซื้อ อายุ ทางแป้นพิมพ์ แล้วแสดงผลออกมาว่า ฃื่อ อายุนั้น เป็น เด็ก คนหนุ่ม หรือคนแก่
# แายุน้อยกว่า 18 คือเด็ก / อายุ 19 - 45 คนหนุ่ม/ 46 ขึ้นไปคือคนแก่

# หาฟีเจอร์การทำงาน เพื่อจะเอาไปเขียนฟังก์ชั่น
# ฟีเจอร์ รับค่าข้อมูล , ตรวจสอบและแสดงผลว่าเป็น เด็ก คนหนุ่ม หรือคนแก่ , แสดงชื่อโปรแกรม

def showProgramName() :
    print('**==โปรแกรมความเป็นเด็ก หนุ่ม แก่ชช**')

def inputData( ) :
    name = input('ป้อนฃื่อ')
    age = int(input('ป้อนอายุ'))
    return name, age

def checkShowStatus( name, age ) :
    if age <= 18 :
        print(f'คุณ{name} อายุ {age} ปี เป็นเด็ก')
    elif age >= 19 and age <= 45 :
        print(f'คุณ{name} อายุ {age} ปี เป็นคนหนุ่ม')
    else :
        print(f'คุณ{name} อายุ {age} ปี เป็นคนแก่')

print('------------------------')
showProgramName
print('------------------------')
name, age = inputData()
print('------------------------')
checkShowStatus  ( name, age )
print('------------------------')

